MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_bus.h
/**
  ******************************************************************************
  * @file    stm32c5xx_ll_bus.h
  * @brief   Header file of LL BUS module.

  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
                      ##### RCC Limitations #####
  ==============================================================================
    [..]
      A delay between an RCC peripheral clock enable and the effective peripheral
      enabling must be taken into account in order to manage the peripheral read/write
      from/to registers.
      (+) This delay depends on the peripheral mapping.
        (++) AHB, APB peripherals, one dummy read is necessary

    [..]
      Workarounds:
      (#) For AHB, APB peripherals, a dummy read of the peripheral register has been
          inserted in each LL_{BUS}_GRP{x}_EnableClock() function.

  @endverbatim
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_LL_BUS_H
#define STM32C5XX_LL_BUS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5XX_LL_Driver
  * @{
  */

#if defined(RCC)

/** @defgroup BUS_LL BUS
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup BUS_LL_Exported_Constants LL BUS Constants
  * @{
  */

/** @defgroup BUS_LL_EC_AHB1_GRP1_PERIPH  AHB1 GRP1 PERIPH
  * @{
  */
#define LL_AHB1_GRP1_PERIPH_ALL           0xFFFFFFFFU
#if defined(ETH1)
#define LL_AHB1_GRP1_PERIPH_ALL_EN_MASK   (RCC_AHB1ENR_LPDMA1EN | RCC_AHB1ENR_LPDMA2EN | RCC_AHB1ENR_FLASHEN  | \
                                           RCC_AHB1ENR_CRCEN    | RCC_AHB1ENR_CORDICEN | RCC_AHB1ENR_RAMCFGEN | \
                                           RCC_AHB1ENR_ETH1CKEN | RCC_AHB1ENR_ETH1EN   | RCC_AHB1ENR_ETH1TXEN | \
                                           RCC_AHB1ENR_ETH1RXEN | RCC_AHB1ENR_SRAM2EN  | RCC_AHB1ENR_SRAM1EN)
#define LL_AHB1_GRP1_PERIPH_ALL_LPEN_MASK (RCC_AHB1LPENR_LPDMA1LPEN | RCC_AHB1LPENR_LPDMA2LPEN  | \
                                           RCC_AHB1LPENR_FLASHLPEN  | RCC_AHB1LPENR_CRCLPEN     | \
                                           RCC_AHB1LPENR_CORDICLPEN | RCC_AHB1LPENR_RAMCFGLPEN  | \
                                           RCC_AHB1LPENR_ICACHELPEN | RCC_AHB1LPENR_ETH1CLKLPEN | \
                                           RCC_AHB1LPENR_ETH1LPEN   | RCC_AHB1LPENR_ETH1TXLPEN  | \
                                           RCC_AHB1LPENR_ETH1RXLPEN |RCC_AHB1LPENR_SRAM2LPEN    | \
                                           RCC_AHB1LPENR_SRAM1LPEN)
#define LL_AHB1_GRP1_PERIPH_ALL_RST_MASK  (RCC_AHB1RSTR_LPDMA1RST | RCC_AHB1RSTR_LPDMA2RST | RCC_AHB1RSTR_CRCRST | \
                                           RCC_AHB1RSTR_CORDICRST | RCC_AHB1RSTR_RAMCFGRST | RCC_AHB1RSTR_ETH1RST )
#else
#define LL_AHB1_GRP1_PERIPH_ALL_EN_MASK   (RCC_AHB1ENR_LPDMA1EN | RCC_AHB1ENR_LPDMA2EN | RCC_AHB1ENR_FLASHEN  | \
                                           RCC_AHB1ENR_CRCEN    | RCC_AHB1ENR_CORDICEN | RCC_AHB1ENR_RAMCFGEN | \
                                           RCC_AHB1ENR_SRAM2EN  | RCC_AHB1ENR_SRAM1EN)
#define LL_AHB1_GRP1_PERIPH_ALL_LPEN_MASK (RCC_AHB1LPENR_LPDMA1LPEN | RCC_AHB1LPENR_LPDMA2LPEN | \
                                           RCC_AHB1LPENR_FLASHLPEN  | RCC_AHB1LPENR_CRCLPEN    | \
                                           RCC_AHB1LPENR_CORDICLPEN | RCC_AHB1LPENR_RAMCFGLPEN | \
                                           RCC_AHB1LPENR_ICACHELPEN | RCC_AHB1LPENR_SRAM2LPEN  | \
                                           RCC_AHB1LPENR_SRAM1LPEN)
#define LL_AHB1_GRP1_PERIPH_ALL_RST_MASK  (RCC_AHB1RSTR_LPDMA1RST | RCC_AHB1RSTR_LPDMA2RST | RCC_AHB1RSTR_CRCRST | \
                                           RCC_AHB1RSTR_CORDICRST | RCC_AHB1RSTR_RAMCFGRST)
#endif /* ETH1 */
#define LL_AHB1_GRP1_PERIPH_LPDMA1        RCC_AHB1ENR_LPDMA1EN
#define LL_AHB1_GRP1_PERIPH_LPDMA2        RCC_AHB1ENR_LPDMA2EN
#define LL_AHB1_GRP1_PERIPH_FLASH         RCC_AHB1ENR_FLASHEN
#define LL_AHB1_GRP1_PERIPH_CRC           RCC_AHB1ENR_CRCEN
#define LL_AHB1_GRP1_PERIPH_CORDIC        RCC_AHB1ENR_CORDICEN
#define LL_AHB1_GRP1_PERIPH_RAMCFG        RCC_AHB1ENR_RAMCFGEN
#define LL_AHB1_GRP1_PERIPH_ICACHE1       RCC_AHB1LPENR_ICACHELPEN
#if defined(ETH1)
#define LL_AHB1_GRP1_PERIPH_ETH1CK        RCC_AHB1ENR_ETH1CKEN
#define LL_AHB1_GRP1_PERIPH_ETH1          RCC_AHB1ENR_ETH1EN
#define LL_AHB1_GRP1_PERIPH_ETH1TX        RCC_AHB1ENR_ETH1TXEN
#define LL_AHB1_GRP1_PERIPH_ETH1RX        RCC_AHB1ENR_ETH1RXEN
#endif /* ETH1 */
#define LL_AHB1_GRP1_PERIPH_SRAM2         RCC_AHB1ENR_SRAM2EN
#define LL_AHB1_GRP1_PERIPH_SRAM1         RCC_AHB1ENR_SRAM1EN
/**
  * @}
  */ /* End of BUS_LL_EC_AHB1_GRP1_PERIPH */

/** @defgroup BUS_LL_EC_AHB2_GRP1_PERIPH  AHB2 GRP1 PERIPH
  * @{
  */
#define LL_AHB2_GRP1_PERIPH_ALL           0xFFFFFFFFU
#if defined(GPIOF)
#if defined(AES)
#define LL_AHB2_GRP1_PERIPH_ALL_EN_MASK    (RCC_AHB2ENR_GPIOAEN | RCC_AHB2ENR_GPIOBEN | RCC_AHB2ENR_GPIOCEN | \
                                            RCC_AHB2ENR_GPIODEN | RCC_AHB2ENR_GPIOEEN | RCC_AHB2ENR_GPIOFEN | \
                                            RCC_AHB2ENR_GPIOGEN | RCC_AHB2ENR_GPIOHEN | RCC_AHB2ENR_ADC12EN | \
                                            RCC_AHB2ENR_DAC1EN  | RCC_AHB2ENR_AESEN   | RCC_AHB2ENR_HASHEN  | \
                                            RCC_AHB2ENR_RNGEN   | RCC_AHB2ENR_PKAEN   | RCC_AHB2ENR_SAESEN  | \
                                            RCC_AHB2ENR_CCBEN   | RCC_AHB2ENR_ADC3EN)
#define LL_AHB2_GRP1_PERIPH_ALL_LPEN_MASK  (RCC_AHB2LPENR_GPIOALPEN | RCC_AHB2LPENR_GPIOBLPEN | \
                                            RCC_AHB2LPENR_GPIOCLPEN | RCC_AHB2LPENR_GPIODLPEN | \
                                            RCC_AHB2LPENR_GPIOELPEN | RCC_AHB2LPENR_GPIOFLPEN | \
                                            RCC_AHB2LPENR_GPIOGLPEN | RCC_AHB2LPENR_GPIOHLPEN | \
                                            RCC_AHB2LPENR_ADC12LPEN | RCC_AHB2LPENR_DAC1LPEN  | \
                                            RCC_AHB2LPENR_AESLPEN   | RCC_AHB2LPENR_HASHLPEN  | \
                                            RCC_AHB2LPENR_RNGLPEN   | RCC_AHB2LPENR_PKALPEN   | \
                                            RCC_AHB2LPENR_SAESLPEN  | RCC_AHB2LPENR_CCBLPEN   | \
                                            RCC_AHB2LPENR_ADC3LPEN)
#define LL_AHB2_GRP1_PERIPH_ALL_RST_MASK   (RCC_AHB2RSTR_GPIOARST | RCC_AHB2RSTR_GPIOBRST | RCC_AHB2RSTR_GPIOCRST | \
                                            RCC_AHB2RSTR_GPIODRST | RCC_AHB2RSTR_GPIOERST | RCC_AHB2RSTR_GPIOFRST | \
                                            RCC_AHB2RSTR_GPIOGRST | RCC_AHB2RSTR_GPIOHRST | RCC_AHB2RSTR_ADC12RST | \
                                            RCC_AHB2RSTR_DAC1RST  | RCC_AHB2RSTR_AESRST   | RCC_AHB2RSTR_HASHRST  | \
                                            RCC_AHB2RSTR_RNGRST   | RCC_AHB2RSTR_PKARST   | RCC_AHB2RSTR_SAESRST  | \
                                            RCC_AHB2RSTR_CCBRST   | RCC_AHB2RSTR_ADC3RST)
#else
#define LL_AHB2_GRP1_PERIPH_ALL_EN_MASK    (RCC_AHB2ENR_GPIOAEN | RCC_AHB2ENR_GPIOBEN | RCC_AHB2ENR_GPIOCEN | \
                                            RCC_AHB2ENR_GPIODEN | RCC_AHB2ENR_GPIOEEN | RCC_AHB2ENR_GPIOFEN | \
                                            RCC_AHB2ENR_GPIOGEN | RCC_AHB2ENR_GPIOHEN | RCC_AHB2ENR_ADC12EN | \
                                            RCC_AHB2ENR_DAC1EN  | RCC_AHB2ENR_HASHEN  | RCC_AHB2ENR_RNGEN   | \
                                            RCC_AHB2ENR_PKAEN   | RCC_AHB2ENR_ADC3EN)
#define LL_AHB2_GRP1_PERIPH_ALL_LPEN_MASK  (RCC_AHB2LPENR_GPIOALPEN | RCC_AHB2LPENR_GPIOBLPEN | \
                                            RCC_AHB2LPENR_GPIOCLPEN | RCC_AHB2LPENR_GPIODLPEN | \
                                            RCC_AHB2LPENR_GPIOELPEN | RCC_AHB2LPENR_GPIOFLPEN | \
                                            RCC_AHB2LPENR_GPIOGLPEN | RCC_AHB2LPENR_GPIOHLPEN | \
                                            RCC_AHB2LPENR_ADC12LPEN | RCC_AHB2LPENR_DAC1LPEN  | \
                                            RCC_AHB2LPENR_HASHLPEN  | RCC_AHB2LPENR_RNGLPEN   | \
                                            RCC_AHB2LPENR_PKALPEN   | RCC_AHB2LPENR_ADC3LPEN)
#define LL_AHB2_GRP1_PERIPH_ALL_RST_MASK   (RCC_AHB2RSTR_GPIOARST | RCC_AHB2RSTR_GPIOBRST | RCC_AHB2RSTR_GPIOCRST | \
                                            RCC_AHB2RSTR_GPIODRST | RCC_AHB2RSTR_GPIOERST | RCC_AHB2RSTR_GPIOFRST | \
                                            RCC_AHB2RSTR_GPIOGRST | RCC_AHB2RSTR_GPIOHRST | RCC_AHB2RSTR_ADC12RST | \
                                            RCC_AHB2RSTR_DAC1RST  | RCC_AHB2RSTR_HASHRST  | RCC_AHB2RSTR_RNGRST   | \
                                            RCC_AHB2RSTR_PKARST  | RCC_AHB2RSTR_ADC3RST)
#endif /* AES */
#else
#if defined(AES)
#define LL_AHB2_GRP1_PERIPH_ALL_EN_MASK    (RCC_AHB2ENR_GPIOAEN | RCC_AHB2ENR_GPIOBEN | RCC_AHB2ENR_GPIOCEN | \
                                            RCC_AHB2ENR_GPIODEN | RCC_AHB2ENR_GPIOEEN | RCC_AHB2ENR_GPIOHEN | \
                                            RCC_AHB2ENR_ADC12EN | RCC_AHB2ENR_DAC1EN  | RCC_AHB2ENR_AESEN | \
                                            RCC_AHB2ENR_HASHEN  | RCC_AHB2ENR_RNGEN)
#define LL_AHB2_GRP1_PERIPH_ALL_LPEN_MASK  (RCC_AHB2LPENR_GPIOALPEN | RCC_AHB2LPENR_GPIOBLPEN | \
                                            RCC_AHB2LPENR_GPIOCLPEN | RCC_AHB2LPENR_GPIODLPEN | \
                                            RCC_AHB2LPENR_GPIOELPEN | RCC_AHB2LPENR_GPIOHLPEN | \
                                            RCC_AHB2LPENR_ADC12LPEN | RCC_AHB2LPENR_DAC1LPEN  | \
                                            RCC_AHB2LPENR_AESLPEN   | RCC_AHB2LPENR_HASHLPEN  | \
                                            RCC_AHB2LPENR_RNGLPEN)
#define LL_AHB2_GRP1_PERIPH_ALL_RST_MASK   (RCC_AHB2RSTR_GPIOARST | RCC_AHB2RSTR_GPIOBRST | RCC_AHB2RSTR_GPIOCRST | \
                                            RCC_AHB2RSTR_GPIODRST | RCC_AHB2RSTR_GPIOERST | RCC_AHB2RSTR_GPIOHRST | \
                                            RCC_AHB2RSTR_ADC12RST | RCC_AHB2RSTR_DAC1RST  | RCC_AHB2RSTR_AESRST | \
                                            RCC_AHB2RSTR_HASHRST  | RCC_AHB2RSTR_RNGRST)
#else
#define LL_AHB2_GRP1_PERIPH_ALL_EN_MASK    (RCC_AHB2ENR_GPIOAEN | RCC_AHB2ENR_GPIOBEN | RCC_AHB2ENR_GPIOCEN | \
                                            RCC_AHB2ENR_GPIODEN | RCC_AHB2ENR_GPIOEEN | RCC_AHB2ENR_GPIOHEN | \
                                            RCC_AHB2ENR_ADC12EN | RCC_AHB2ENR_DAC1EN  | \
                                            RCC_AHB2ENR_HASHEN  | RCC_AHB2ENR_RNGEN)
#define LL_AHB2_GRP1_PERIPH_ALL_LPEN_MASK  (RCC_AHB2LPENR_GPIOALPEN | RCC_AHB2LPENR_GPIOBLPEN | \
                                            RCC_AHB2LPENR_GPIOCLPEN | RCC_AHB2LPENR_GPIODLPEN | \
                                            RCC_AHB2LPENR_GPIOELPEN | RCC_AHB2LPENR_GPIOHLPEN | \
                                            RCC_AHB2LPENR_ADC12LPEN | RCC_AHB2LPENR_DAC1LPEN  | \
                                            RCC_AHB2LPENR_HASHLPEN  | RCC_AHB2LPENR_RNGLPEN)
#define LL_AHB2_GRP1_PERIPH_ALL_RST_MASK   (RCC_AHB2RSTR_GPIOARST | RCC_AHB2RSTR_GPIOBRST | RCC_AHB2RSTR_GPIOCRST | \
                                            RCC_AHB2RSTR_GPIODRST | RCC_AHB2RSTR_GPIOERST | RCC_AHB2RSTR_GPIOHRST | \
                                            RCC_AHB2RSTR_ADC12RST | RCC_AHB2RSTR_DAC1RST  | \
                                            RCC_AHB2RSTR_HASHRST  | RCC_AHB2RSTR_RNGRST)
#endif /* AES */
#endif /* GPIOF */
#define LL_AHB2_GRP1_PERIPH_GPIOA         RCC_AHB2ENR_GPIOAEN
#define LL_AHB2_GRP1_PERIPH_GPIOB         RCC_AHB2ENR_GPIOBEN
#define LL_AHB2_GRP1_PERIPH_GPIOC         RCC_AHB2ENR_GPIOCEN
#define LL_AHB2_GRP1_PERIPH_GPIOD         RCC_AHB2ENR_GPIODEN
#define LL_AHB2_GRP1_PERIPH_GPIOE         RCC_AHB2ENR_GPIOEEN
#if defined(GPIOF)
#define LL_AHB2_GRP1_PERIPH_GPIOF         RCC_AHB2ENR_GPIOFEN
#endif /* GPIOF */
#if defined(GPIOG)
#define LL_AHB2_GRP1_PERIPH_GPIOG         RCC_AHB2ENR_GPIOGEN
#endif /* GPIOG */
#define LL_AHB2_GRP1_PERIPH_GPIOH         RCC_AHB2ENR_GPIOHEN
#define LL_AHB2_GRP1_PERIPH_ADC12         RCC_AHB2ENR_ADC12EN
#define LL_AHB2_GRP1_PERIPH_DAC1          RCC_AHB2ENR_DAC1EN
#if defined(AES)
#define LL_AHB2_GRP1_PERIPH_AES           RCC_AHB2ENR_AESEN
#endif /* AES */
#define LL_AHB2_GRP1_PERIPH_HASH          RCC_AHB2ENR_HASHEN
#define LL_AHB2_GRP1_PERIPH_RNG           RCC_AHB2ENR_RNGEN
#if defined(PKA)
#define LL_AHB2_GRP1_PERIPH_PKA           RCC_AHB2ENR_PKAEN
#else
#define LL_AHB2_GRP1_PERIPH_PKA
#endif /* PKA */
#if defined(SAES)
#define LL_AHB2_GRP1_PERIPH_SAES          RCC_AHB2ENR_SAESEN
#else
#define LL_AHB2_GRP1_PERIPH_SAES
#endif /* SAES */
#if defined(CCB)
#define LL_AHB2_GRP1_PERIPH_CCB           RCC_AHB2ENR_CCBEN
#else
#define LL_AHB2_GRP1_PERIPH_CCB
#endif /* CCB */
#if defined(ADC3)
#define LL_AHB2_GRP1_PERIPH_ADC3          RCC_AHB2ENR_ADC3EN
#endif /* ADC3 */
/**
  * @}
  */ /* End of BUS_LL_EC_AHB2_GRP1_PERIPH */

#if defined(AHB4PERIPH_BASE)
/** @defgroup BUS_LL_EC_AHB4_GRP1_PERIPH  AHB4 GRP1 PERIPH
  * @{
  */
#define LL_AHB4_GRP1_PERIPH_ALL           0xFFFFFFFFU
#define LL_AHB4_GRP1_PERIPH_ALL_EN_MASK   RCC_AHB4ENR_XSPI1EN
#define LL_AHB4_GRP1_PERIPH_ALL_LPEN_MASK RCC_AHB4LPENR_XSPI1LPEN
#define LL_AHB4_GRP1_PERIPH_ALL_RST_MASK  RCC_AHB4RSTR_XSPI1RST
#define LL_AHB4_GRP1_PERIPH_XSPI1         RCC_AHB4ENR_XSPI1EN
/**
  * @}
  */ /* End of BUS_LL_EC_AHB4_GRP1_PERIPH */
#endif /* AHB4PERIPH_BASE */

/** @defgroup BUS_LL_EC_APB1_GRP1_PERIPH  APB1 GRP1 PERIPH
  * @{
  */
#define LL_APB1_GRP1_PERIPH_ALL           0xFFFFFFFFU
#if defined(TIM3)
#define LL_APB1_GRP1_PERIPH_ALL_EN_MASK   (RCC_APB1LENR_TIM2EN   | RCC_APB1LENR_TIM3EN   | RCC_APB1LENR_TIM4EN   | \
                                           RCC_APB1LENR_TIM5EN   | RCC_APB1LENR_TIM6EN   | RCC_APB1LENR_TIM7EN   | \
                                           RCC_APB1LENR_TIM12EN  | RCC_APB1LENR_WWDGEN   |  RCC_APB1LENR_SPI2EN   | \
                                           RCC_APB1LENR_SPI3EN   | RCC_APB1LENR_USART2EN | RCC_APB1LENR_USART3EN | \
                                           RCC_APB1LENR_UART4EN  | RCC_APB1LENR_UART5EN  | RCC_APB1LENR_I2C1EN   | \
                                           RCC_APB1LENR_I2C2EN   | RCC_APB1LENR_I3C1EN   | RCC_APB1LENR_CRSEN    | \
                                           RCC_APB1LENR_USART6EN | RCC_APB1LENR_UART7EN)
#define LL_APB1_GRP1_PERIPH_ALL_LPEN_MASK (RCC_APB1LLPENR_TIM2LPEN   | RCC_APB1LLPENR_TIM3LPEN   | \
                                           RCC_APB1LLPENR_TIM4LPEN   | RCC_APB1LLPENR_TIM5LPEN   | \
                                           RCC_APB1LLPENR_TIM6LPEN   | RCC_APB1LLPENR_TIM7LPEN   | \
                                           RCC_APB1LLPENR_TIM12LPEN  | RCC_APB1LLPENR_WWDGLPEN   | \
                                           RCC_APB1LLPENR_SPI2LPEN   | RCC_APB1LLPENR_SPI3LPEN   | \
                                           RCC_APB1LLPENR_USART2LPEN | RCC_APB1LLPENR_USART3LPEN | \
                                           RCC_APB1LLPENR_UART4LPEN  | RCC_APB1LLPENR_UART5LPEN  | \
                                           RCC_APB1LLPENR_I2C1LPEN   | RCC_APB1LLPENR_I2C2LPEN   | \
                                           RCC_APB1LLPENR_I3C1LPEN   | RCC_APB1LLPENR_CRSLPEN    | \
                                           RCC_APB1LLPENR_USART6LPEN | RCC_APB1LLPENR_UART7LPEN)
#define LL_APB1_GRP1_PERIPH_ALL_RST_MASK  (RCC_APB1LRSTR_TIM2RST   | RCC_APB1LRSTR_TIM3RST   | \
                                           RCC_APB1LRSTR_TIM4RST   | RCC_APB1LRSTR_TIM5RST   | \
                                           RCC_APB1LRSTR_TIM6RST   | RCC_APB1LRSTR_TIM7RST   | \
                                           RCC_APB1LRSTR_TIM12RST  | RCC_APB1LRSTR_SPI2RST   | \
                                           RCC_APB1LRSTR_SPI3RST   | RCC_APB1LRSTR_USART2RST | \
                                           RCC_APB1LRSTR_USART3RST | RCC_APB1LRSTR_UART4RST  | \
                                           RCC_APB1LRSTR_UART5RST  | RCC_APB1LRSTR_I2C1RST   | \
                                           RCC_APB1LRSTR_I2C2RST   | RCC_APB1LRSTR_I3C1RST   | \
                                           RCC_APB1LRSTR_CRSRST    | RCC_APB1LRSTR_USART6RST | \
                                           RCC_APB1LRSTR_UART7RST)
#elif defined(TIM5)
#define LL_APB1_GRP1_PERIPH_ALL_EN_MASK   (RCC_APB1LENR_TIM2EN | RCC_APB1LENR_TIM5EN | RCC_APB1LENR_TIM6EN | \
                                           RCC_APB1LENR_TIM7EN | RCC_APB1LENR_TIM12EN | RCC_APB1LENR_WWDGEN | \
                                           RCC_APB1LENR_SPI2EN | RCC_APB1LENR_SPI3EN | RCC_APB1LENR_USART2EN | \
                                           RCC_APB1LENR_USART3EN | RCC_APB1LENR_UART4EN | RCC_APB1LENR_UART5EN | \
                                           RCC_APB1LENR_I2C1EN | RCC_APB1LENR_I2C2EN | RCC_APB1LENR_I3C1EN | \
                                           RCC_APB1LENR_CRSEN)
#define LL_APB1_GRP1_PERIPH_ALL_LPEN_MASK (RCC_APB1LLPENR_TIM2LPEN | RCC_APB1LLPENR_TIM5LPEN | \
                                           RCC_APB1LLPENR_TIM6LPEN | RCC_APB1LLPENR_TIM7LPEN | \
                                           RCC_APB1LLPENR_TIM12LPEN | RCC_APB1LLPENR_WWDGLPEN | \
                                           RCC_APB1LLPENR_SPI2LPEN | RCC_APB1LLPENR_SPI3LPEN | \
                                           RCC_APB1LLPENR_USART2LPEN | RCC_APB1LLPENR_USART3LPEN | \
                                           RCC_APB1LLPENR_UART4LPEN | RCC_APB1LLPENR_UART5LPEN | \
                                           RCC_APB1LLPENR_I2C1LPEN | RCC_APB1LLPENR_I2C2LPEN | \
                                           RCC_APB1LLPENR_I3C1LPEN | RCC_APB1LLPENR_CRSLPEN)
#define LL_APB1_GRP1_PERIPH_ALL_RST_MASK  (RCC_APB1LRSTR_TIM2RST | RCC_APB1LRSTR_TIM5RST | RCC_APB1LRSTR_TIM6RST | \
                                           RCC_APB1LRSTR_TIM7RST | RCC_APB1LRSTR_TIM12RST | RCC_APB1LRSTR_SPI2RST | \
                                           RCC_APB1LRSTR_SPI3RST | RCC_APB1LRSTR_USART2RST | RCC_APB1LRSTR_USART3RST |\
                                           RCC_APB1LRSTR_UART4RST | RCC_APB1LRSTR_UART5RST | RCC_APB1LRSTR_I2C1RST | \
                                           RCC_APB1LRSTR_I2C2RST | RCC_APB1LRSTR_I3C1RST | RCC_APB1LRSTR_CRSRST)
#else
#define LL_APB1_GRP1_PERIPH_ALL_EN_MASK   (RCC_APB1LENR_TIM2EN | RCC_APB1LENR_TIM6EN | RCC_APB1LENR_TIM7EN | \
                                           RCC_APB1LENR_TIM12EN | RCC_APB1LENR_WWDGEN | RCC_APB1LENR_OPAMP1EN | \
                                           RCC_APB1LENR_SPI2EN | RCC_APB1LENR_USART2EN | RCC_APB1LENR_UART4EN | \
                                           RCC_APB1LENR_UART5EN | RCC_APB1LENR_I2C1EN | RCC_APB1LENR_I3C1EN | \
                                           RCC_APB1LENR_CRSEN)
#define LL_APB1_GRP1_PERIPH_ALL_LPEN_MASK (RCC_APB1LLPENR_TIM2LPEN | RCC_APB1LLPENR_TIM6LPEN | \
                                           RCC_APB1LLPENR_TIM7LPEN | RCC_APB1LLPENR_TIM12LPEN | \
                                           RCC_APB1LLPENR_WWDGLPEN | RCC_APB1LLPENR_OPAMP1LPEN | \
                                           RCC_APB1LLPENR_SPI2LPEN | RCC_APB1LLPENR_USART2LPEN | \
                                           RCC_APB1LLPENR_UART4LPEN | RCC_APB1LLPENR_UART5LPEN | \
                                           RCC_APB1LLPENR_I2C1LPEN | RCC_APB1LLPENR_I3C1LPEN | \
                                           RCC_APB1LLPENR_CRSLPEN)
#define LL_APB1_GRP1_PERIPH_ALL_RST_MASK  (RCC_APB1LRSTR_TIM2RST | RCC_APB1LRSTR_TIM6RST | RCC_APB1LRSTR_TIM7RST | \
                                           RCC_APB1LRSTR_TIM12RST | RCC_APB1LRSTR_OPAMP1RST | RCC_APB1LRSTR_SPI2RST | \
                                           RCC_APB1LRSTR_USART2RST | RCC_APB1LRSTR_UART4RST | RCC_APB1LRSTR_UART5RST |\
                                           RCC_APB1LRSTR_I2C1RST | RCC_APB1LRSTR_I3C1RST | RCC_APB1LRSTR_CRSRST)
#endif /* TIM3 */
#define LL_APB1_GRP1_PERIPH_TIM2          RCC_APB1LENR_TIM2EN
#if defined(TIM3)
#define LL_APB1_GRP1_PERIPH_TIM3          RCC_APB1LENR_TIM3EN
#endif /* TIM3 */
#if defined(TIM4)
#define LL_APB1_GRP1_PERIPH_TIM4          RCC_APB1LENR_TIM4EN
#endif /* TIM4 */
#if defined(TIM5)
#define LL_APB1_GRP1_PERIPH_TIM5          RCC_APB1LENR_TIM5EN
#endif /* TIM5 */
#define LL_APB1_GRP1_PERIPH_TIM6          RCC_APB1LENR_TIM6EN
#define LL_APB1_GRP1_PERIPH_TIM7          RCC_APB1LENR_TIM7EN
#define LL_APB1_GRP1_PERIPH_TIM12         RCC_APB1LENR_TIM12EN
#define LL_APB1_GRP1_PERIPH_WWDG          RCC_APB1LENR_WWDGEN
#if defined(OPAMP1)
#define LL_APB1_GRP1_PERIPH_OPAMP1        RCC_APB1LENR_OPAMP1EN
#endif /* OPAMP1 */
#define LL_APB1_GRP1_PERIPH_SPI2          RCC_APB1LENR_SPI2EN
#if defined(SPI3)
#define LL_APB1_GRP1_PERIPH_SPI3          RCC_APB1LENR_SPI3EN
#endif /* SPI3 */
#define LL_APB1_GRP1_PERIPH_USART2        RCC_APB1LENR_USART2EN
#if defined(USART3)
#define LL_APB1_GRP1_PERIPH_USART3        RCC_APB1LENR_USART3EN
#endif /* USART3 */
#define LL_APB1_GRP1_PERIPH_UART4         RCC_APB1LENR_UART4EN
#define LL_APB1_GRP1_PERIPH_UART5         RCC_APB1LENR_UART5EN
#define LL_APB1_GRP1_PERIPH_I2C1          RCC_APB1LENR_I2C1EN
#if defined(I2C2)
#define LL_APB1_GRP1_PERIPH_I2C2          RCC_APB1LENR_I2C2EN
#endif /* I2C2 */
#define LL_APB1_GRP1_PERIPH_I3C1          RCC_APB1LENR_I3C1EN
#define LL_APB1_GRP1_PERIPH_CRS           RCC_APB1LENR_CRSEN
#if defined(USART6)
#define LL_APB1_GRP1_PERIPH_USART6        RCC_APB1LENR_USART6EN
#endif /* USART6 */
#if defined(UART7)
#define LL_APB1_GRP1_PERIPH_UART7         RCC_APB1LENR_UART7EN
#endif /* UART7 */
/**
  * @}
  */ /* End of BUS_LL_EC_APB1_GRP1_PERIPH */

