MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_bus.h
/** @defgroup BUS_LL_EC_APB1_GRP2_PERIPH  APB1 GRP2 PERIPH
  * @{
  */
#define LL_APB1_GRP2_PERIPH_ALL           0xFFFFFFFFU
#if defined(FDCAN1)
#define LL_APB1_GRP2_PERIPH_ALL_EN_MASK   (RCC_APB1HENR_COMP12EN | RCC_APB1HENR_FDCANEN)
#define LL_APB1_GRP2_PERIPH_ALL_LPEN_MASK (RCC_APB1HLPENR_COMP12LPEN | RCC_APB1HLPENR_FDCANLPEN)
#define LL_APB1_GRP2_PERIPH_ALL_RST_MASK  (RCC_APB1HRSTR_COMP12RST | RCC_APB1HRSTR_FDCANRST)
#else
#define LL_APB1_GRP2_PERIPH_ALL_EN_MASK   (RCC_APB1HENR_COMP12EN)
#define LL_APB1_GRP2_PERIPH_ALL_LPEN_MASK (RCC_APB1HLPENR_COMP12LPEN)
#define LL_APB1_GRP2_PERIPH_ALL_RST_MASK  (RCC_APB1HRSTR_COMP12RST)
#endif /* FDCAN1 */

#define LL_APB1_GRP2_PERIPH_COMP12         RCC_APB1HENR_COMP12EN
#if defined(FDCAN1)
#define LL_APB1_GRP2_PERIPH_FDCAN         RCC_APB1HENR_FDCANEN
#endif /* FDCAN1 */
/**
  * @}
  */ /* End of BUS_LL_EC_APB1_GRP2_PERIPH */

/** @defgroup BUS_LL_EC_APB2_GRP1_PERIPH  APB2 GRP1 PERIPH
  * @{
  */
#define LL_APB2_GRP1_PERIPH_ALL           0xFFFFFFFFU
#if defined(TIM16)
#define LL_APB2_GRP1_PERIPH_ALL_EN_MASK   (RCC_APB2ENR_TIM1EN   | RCC_APB2ENR_SPI1EN  | RCC_APB2ENR_TIM8EN  | \
                                           RCC_APB2ENR_USART1EN | RCC_APB2ENR_TIM15EN | RCC_APB2ENR_TIM16EN | \
                                           RCC_APB2ENR_TIM17EN  | RCC_APB2ENR_USBEN)
#define LL_APB2_GRP1_PERIPH_ALL_LPEN_MASK (RCC_APB2LPENR_TIM1LPEN   | RCC_APB2LPENR_SPI1LPEN   | \
                                           RCC_APB2LPENR_TIM8LPEN   | RCC_APB2LPENR_USART1LPEN | \
                                           RCC_APB2LPENR_TIM15LPEN  | RCC_APB2LPENR_TIM16LPEN  | \
                                           RCC_APB2LPENR_TIM17LPEN | RCC_APB2LPENR_USBLPEN)
#define LL_APB2_GRP1_PERIPH_ALL_RST_MASK  (RCC_APB2RSTR_TIM1RST   | RCC_APB2RSTR_SPI1RST  | RCC_APB2RSTR_TIM8RST | \
                                           RCC_APB2RSTR_USART1RST | RCC_APB2RSTR_TIM15RST | RCC_APB2RSTR_TIM16RST | \
                                           RCC_APB2RSTR_TIM17RST  | RCC_APB2RSTR_USBRST)
#else
#define LL_APB2_GRP1_PERIPH_ALL_EN_MASK   (RCC_APB2ENR_TIM1EN   | RCC_APB2ENR_SPI1EN  | RCC_APB2ENR_TIM8EN | \
                                           RCC_APB2ENR_USART1EN | RCC_APB2ENR_TIM15EN | RCC_APB2ENR_USBEN)
#define LL_APB2_GRP1_PERIPH_ALL_LPEN_MASK (RCC_APB2LPENR_TIM1LPEN   | RCC_APB2LPENR_SPI1LPEN    | \
                                           RCC_APB2LPENR_TIM8LPEN   |  RCC_APB2LPENR_USART1LPEN | \
                                           RCC_APB2LPENR_TIM15LPEN | RCC_APB2LPENR_USBLPEN)
#define LL_APB2_GRP1_PERIPH_ALL_RST_MASK  (RCC_APB2RSTR_TIM1RST   | RCC_APB2RSTR_SPI1RST  | RCC_APB2RSTR_TIM8RST | \
                                           RCC_APB2RSTR_USART1RST | RCC_APB2RSTR_TIM15RST | RCC_APB2RSTR_USBRST)
#endif /* TIM16 */
#define LL_APB2_GRP1_PERIPH_TIM1          RCC_APB2ENR_TIM1EN
#define LL_APB2_GRP1_PERIPH_SPI1          RCC_APB2ENR_SPI1EN
#define LL_APB2_GRP1_PERIPH_TIM8          RCC_APB2ENR_TIM8EN
#define LL_APB2_GRP1_PERIPH_USART1        RCC_APB2ENR_USART1EN
#define LL_APB2_GRP1_PERIPH_TIM15         RCC_APB2ENR_TIM15EN
#if defined(TIM16)
#define LL_APB2_GRP1_PERIPH_TIM16         RCC_APB2ENR_TIM16EN
#endif /* TIM16 */
#if defined(TIM17)
#define LL_APB2_GRP1_PERIPH_TIM17         RCC_APB2ENR_TIM17EN
#endif /* TIM17 */
#define LL_APB2_GRP1_PERIPH_USB           RCC_APB2ENR_USBEN
/**
  * @}
  */ /* End of BUS_LL_EC_APB2_GRP1_PERIPH */

/** @defgroup BUS_LL_EC_APB3_GRP1_PERIPH  APB3 GRP1 PERIPH
  * @{
  */
#define LL_APB3_GRP1_PERIPH_ALL           0xFFFFFFFFU
#define LL_APB3_GRP1_PERIPH_ALL_EN_MASK   (RCC_APB3ENR_SBSEN | RCC_APB3ENR_LPUART1EN | RCC_APB3ENR_LPTIM1EN | \
                                           RCC_APB3ENR_RTCAPBEN)
#define LL_APB3_GRP1_PERIPH_ALL_LPEN_MASK (RCC_APB3LPENR_SBSLPEN | RCC_APB3LPENR_LPUART1LPEN | \
                                           RCC_APB3LPENR_LPTIM1LPEN | RCC_APB3LPENR_RTCAPBLPEN)
#define LL_APB3_GRP1_PERIPH_ALL_RST_MASK  (RCC_APB3RSTR_SBSRST | RCC_APB3RSTR_LPUART1RST | RCC_APB3RSTR_LPTIM1RST)
#define LL_APB3_GRP1_PERIPH_SBS           RCC_APB3ENR_SBSEN
#define LL_APB3_GRP1_PERIPH_LPUART1       RCC_APB3ENR_LPUART1EN
#define LL_APB3_GRP1_PERIPH_LPTIM1        RCC_APB3ENR_LPTIM1EN
#define LL_APB3_GRP1_PERIPH_RTCAPB        RCC_APB3ENR_RTCAPBEN

/**
  * @}
  */ /* End of BUS_LL_EC_APB3_GRP1_PERIPH */

/**
  * @}
  */ /* End of BUS_LL_Exported_Constants */

/* Exported macros -----------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @defgroup BUS_LL_Exported_Functions LL BUS Functions
  * @{
  */

/** @defgroup BUS_LL_EF_AHB1 AHB1
  * @{
  */
/**
  * @brief  Enable AHB1 bus clock.
  * @rmtoll
  *  CFGR2         AHB1DIS         LL_AHB1_EnableBusClock
  */
__STATIC_INLINE void LL_AHB1_EnableBusClock(void)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_CLEAR_BIT_32(RCC->CFGR2, RCC_CFGR2_AHB1DIS);
  tmpreg = STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_AHB1DIS);
  (void)(tmpreg);
}
/**
  * @brief  Check if AHB1 bus clock is enabled.
  * @rmtoll
  *  CFGR2         AHB1DIS         LL_AHB1_IsEnabledBusClock
  * @retval State (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB1_IsEnabledBusClock(void)
{
  return ((STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_AHB1DIS) == 0U) ? 1UL : 0UL);
}

/**
  * @brief  Enable AHB1 peripheral clocks.
  * @rmtoll
  *  AHB1ENR         LPDMA1EN         LL_AHB1_GRP1_EnableClock \n
  *  AHB1ENR         LPDMA2EN         LL_AHB1_GRP1_EnableClock \n
  *  AHB1ENR         FLASHEN          LL_AHB1_GRP1_EnableClock \n
  *  AHB1ENR         CRCEN            LL_AHB1_GRP1_EnableClock \n
  *  AHB1ENR         CORDICEN         LL_AHB1_GRP1_EnableClock \n
  *  AHB1ENR         RAMCFGEN         LL_AHB1_GRP1_EnableClock \n
  *  AHB1ENR         ETH1CKEN         LL_AHB1_GRP1_EnableClock \n
  *  AHB1ENR         ETH1EN           LL_AHB1_GRP1_EnableClock \n
  *  AHB1ENR         ETH1TXEN         LL_AHB1_GRP1_EnableClock \n
  *  AHB1ENR         ETH1RXEN         LL_AHB1_GRP1_EnableClock \n
  *  AHB1ENR         SRAM2EN          LL_AHB1_GRP1_EnableClock \n
  *  AHB1ENR         SRAM1EN          LL_AHB1_GRP1_EnableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  * @if ETH1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1CK  (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1    (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1TX  (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1RX  (*)
  * @endif
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_AHB1_GRP1_EnableClock(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->AHB1ENR, periphs & LL_AHB1_GRP1_PERIPH_ALL_EN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->AHB1ENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clock is enabled.
  * @rmtoll
  *  AHB1ENR         LPDMA1EN         LL_AHB1_GRP1_IsEnabledClock \n
  *  AHB1ENR         LPDMA2EN         LL_AHB1_GRP1_IsEnabledClock \n
  *  AHB1ENR         FLASHEN          LL_AHB1_GRP1_IsEnabledClock \n
  *  AHB1ENR         CRCEN            LL_AHB1_GRP1_IsEnabledClock \n
  *  AHB1ENR         CORDICEN         LL_AHB1_GRP1_IsEnabledClock \n
  *  AHB1ENR         RAMCFGEN         LL_AHB1_GRP1_IsEnabledClock \n
  *  AHB1ENR         ETH1CKEN         LL_AHB1_GRP1_IsEnabledClock \n
  *  AHB1ENR         ETH1EN           LL_AHB1_GRP1_IsEnabledClock \n
  *  AHB1ENR         ETH1TXEN         LL_AHB1_GRP1_IsEnabledClock \n
  *  AHB1ENR         ETH1RXEN         LL_AHB1_GRP1_IsEnabledClock \n
  *  AHB1ENR         SRAM2EN          LL_AHB1_GRP1_IsEnabledClock \n
  *  AHB1ENR         SRAM1EN          LL_AHB1_GRP1_IsEnabledClock
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  * @if ETH1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1CK  (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1    (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1TX  (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1RX  (*)
  * @endif
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *        (*) value not defined in all devices.
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB1_GRP1_IsEnabledClock(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->AHB1ENR, periphs & LL_AHB1_GRP1_PERIPH_ALL_EN_MASK) == \
           (periphs & LL_AHB1_GRP1_PERIPH_ALL_EN_MASK)) ? 1UL : 0UL);
}


/**
  * @brief  Disable AHB1 bus clock.
  * @note   except for FLASH, SRAM1 and SRAM2.
  * @rmtoll
  *  CFGR2         AHB1DIS         LL_AHB1_DisableBusClock
  */
__STATIC_INLINE void LL_AHB1_DisableBusClock(void)
{
  STM32_ATOMIC_SET_BIT_32(RCC->CFGR2, RCC_CFGR2_AHB1DIS);
}

/**
  * @brief  Disable AHB1 peripheral clocks.
  * @rmtoll
  *  AHB1ENR         LPDMA1EN         LL_AHB1_GRP1_DisableClock \n
  *  AHB1ENR         LPDMA2EN         LL_AHB1_GRP1_DisableClock \n
  *  AHB1ENR         FLASHEN          LL_AHB1_GRP1_DisableClock \n
  *  AHB1ENR         CRCEN            LL_AHB1_GRP1_DisableClock \n
  *  AHB1ENR         CORDICEN         LL_AHB1_GRP1_DisableClock \n
  *  AHB1ENR         RAMCFGEN         LL_AHB1_GRP1_DisableClock \n
  *  AHB1ENR         ETH1CKEN         LL_AHB1_GRP1_DisableClock \n
  *  AHB1ENR         ETH1EN           LL_AHB1_GRP1_DisableClock \n
  *  AHB1ENR         ETH1TXEN         LL_AHB1_GRP1_DisableClock \n
  *  AHB1ENR         ETH1RXEN         LL_AHB1_GRP1_DisableClock \n
  *  AHB1ENR         SRAM2EN          LL_AHB1_GRP1_DisableClock \n
  *  AHB1ENR         SRAM1EN          LL_AHB1_GRP1_DisableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  * @if ETH1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1CK  (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1    (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1TX  (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1RX  (*)
  * @endif
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_AHB1_GRP1_DisableClock(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->AHB1ENR, periphs & LL_AHB1_GRP1_PERIPH_ALL_EN_MASK);
}

/**
  * @brief  Force AHB1 peripherals reset.
  * @rmtoll
  *  AHB1RSTR         LPDMA1RST         LL_AHB1_GRP1_ForceReset \n
  *  AHB1RSTR         LPDMA2RST         LL_AHB1_GRP1_ForceReset \n
  *  AHB1RSTR         CRCRST            LL_AHB1_GRP1_ForceReset \n
  *  AHB1RSTR         CORDICRST         LL_AHB1_GRP1_ForceReset \n
  *  AHB1RSTR         RAMCFGRST         LL_AHB1_GRP1_ForceReset \n
  *  AHB1RSTR         ETH1RST           LL_AHB1_GRP1_ForceReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  * @if ETH1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1    (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_AHB1_GRP1_ForceReset(uint32_t periphs)
{
  STM32_SET_BIT(RCC->AHB1RSTR, periphs & LL_AHB1_GRP1_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Release AHB1 peripherals reset.
  * @rmtoll
  *  AHB1RSTR         LPDMA1RST         LL_AHB1_GRP1_ReleaseReset \n
  *  AHB1RSTR         LPDMA2RST         LL_AHB1_GRP1_ReleaseReset \n
  *  AHB1RSTR         CRCRST            LL_AHB1_GRP1_ReleaseReset \n
  *  AHB1RSTR         CORDICRST         LL_AHB1_GRP1_ReleaseReset \n
  *  AHB1RSTR         RAMCFGRST         LL_AHB1_GRP1_ReleaseReset \n
  *  AHB1RSTR         ETH1RST           LL_AHB1_GRP1_ReleaseReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  * @if ETH1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1    (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_AHB1_GRP1_ReleaseReset(uint32_t periphs)
{
  STM32_CLEAR_BIT(RCC->AHB1RSTR, periphs & LL_AHB1_GRP1_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Enable AHB1 peripheral clocks in low-power mode.
  * @rmtoll
  *  AHB1LPENR         LPDMA1LPEN         LL_AHB1_GRP1_EnableClockLowPower \n
  *  AHB1LPENR         LPDMA2LPEN         LL_AHB1_GRP1_EnableClockLowPower \n
  *  AHB1LPENR         FLASHLPEN          LL_AHB1_GRP1_EnableClockLowPower \n
  *  AHB1LPENR         CRCLPEN            LL_AHB1_GRP1_EnableClockLowPower \n
  *  AHB1LPENR         CORDICLPEN         LL_AHB1_GRP1_EnableClockLowPower \n
  *  AHB1LPENR         RAMCFGLPEN         LL_AHB1_GRP1_EnableClockLowPower \n
  *  AHB1LPENR         ETH1CKLPEN         LL_AHB1_GRP1_EnableClockLowPower \n
  *  AHB1LPENR         ETH1LPEN           LL_AHB1_GRP1_EnableClockLowPower \n
  *  AHB1LPENR         ETH1TXLPEN         LL_AHB1_GRP1_EnableClockLowPower \n
  *  AHB1LPENR         ETH1RXLPEN         LL_AHB1_GRP1_EnableClockLowPower \n
  *  AHB1LPENR         ICACHELPEN         LL_AHB1_GRP1_EnableClockLowPower \n
  *  AHB1LPENR         SRAM2LPEN          LL_AHB1_GRP1_EnableClockLowPower \n
  *  AHB1LPENR         SRAM1LPEN          LL_AHB1_GRP1_EnableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ICACHE1
  * @if ETH1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1CK  (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1    (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1TX  (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1RX  (*)
  * @endif
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_AHB1_GRP1_EnableClockLowPower(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->AHB1LPENR, periphs & LL_AHB1_GRP1_PERIPH_ALL_LPEN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->AHB1LPENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB1 peripheral clocks in low-power mode are enabled.
  * @rmtoll
  *  AHB1LPENR         LPDMA1LPEN         LL_AHB1_GRP1_IsEnabledClockLowPower \n
  *  AHB1LPENR         LPDMA2LPEN         LL_AHB1_GRP1_IsEnabledClockLowPower \n
  *  AHB1LPENR         FLASHLPEN          LL_AHB1_GRP1_IsEnabledClockLowPower \n
  *  AHB1LPENR         CRCLPEN            LL_AHB1_GRP1_IsEnabledClockLowPower \n
  *  AHB1LPENR         CORDICLPEN         LL_AHB1_GRP1_IsEnabledClockLowPower \n
  *  AHB1LPENR         RAMCFGLPEN         LL_AHB1_GRP1_IsEnabledClockLowPower \n
  *  AHB1LPENR         ETH1CKLPEN         LL_AHB1_GRP1_IsEnabledClockLowPower \n
  *  AHB1LPENR         ETH1LPEN           LL_AHB1_GRP1_IsEnabledClockLowPower \n
  *  AHB1LPENR         ETH1TXLPEN         LL_AHB1_GRP1_IsEnabledClockLowPower \n
  *  AHB1LPENR         ETH1RXLPEN         LL_AHB1_GRP1_IsEnabledClockLowPower \n
  *  AHB1LPENR         ICACHELPEN         LL_AHB1_GRP1_IsEnabledClockLowPower \n
  *  AHB1LPENR         SRAM2LPEN          LL_AHB1_GRP1_IsEnabledClockLowPower \n
  *  AHB1LPENR         SRAM1LPEN          LL_AHB1_GRP1_IsEnabledClockLowPower
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ICACHE1
  * @if ETH1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1CK  (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1    (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1TX  (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1RX  (*)
  * @endif
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *        (*) value not defined in all devices.
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB1_GRP1_IsEnabledClockLowPower(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->AHB1LPENR, periphs & LL_AHB1_GRP1_PERIPH_ALL_LPEN_MASK) == \
           (periphs & LL_AHB1_GRP1_PERIPH_ALL_LPEN_MASK)) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB1 peripheral clocks in low-power mode.
  * @rmtoll
  *  AHB1LPENR         LPDMA1LPEN         LL_AHB1_GRP1_DisableClockLowPower \n
  *  AHB1LPENR         LPDMA2LPEN         LL_AHB1_GRP1_DisableClockLowPower \n
  *  AHB1LPENR         FLASHLPEN          LL_AHB1_GRP1_DisableClockLowPower \n
  *  AHB1LPENR         CRCLPEN            LL_AHB1_GRP1_DisableClockLowPower \n
  *  AHB1LPENR         CORDICLPEN         LL_AHB1_GRP1_DisableClockLowPower \n
  *  AHB1LPENR         RAMCFGLPEN         LL_AHB1_GRP1_DisableClockLowPower \n
  *  AHB1LPENR         ETH1CKLPEN         LL_AHB1_GRP1_DisableClockLowPower \n
  *  AHB1LPENR         ETH1LPEN           LL_AHB1_GRP1_DisableClockLowPower \n
  *  AHB1LPENR         ETH1TXLPEN         LL_AHB1_GRP1_DisableClockLowPower \n
  *  AHB1LPENR         ETH1RXLPEN         LL_AHB1_GRP1_DisableClockLowPower \n
  *  AHB1LPENR         ICACHELPEN         LL_AHB1_GRP1_DisableClockLowPower \n
  *  AHB1LPENR         SRAM2LPEN          LL_AHB1_GRP1_DisableClockLowPower \n
  *  AHB1LPENR         SRAM1LPEN          LL_AHB1_GRP1_DisableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_LPDMA2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_FLASH
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CRC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_CORDIC
  *         @arg @ref LL_AHB1_GRP1_PERIPH_RAMCFG
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ICACHE1
  * @if ETH1
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1CK  (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1    (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1TX  (*)
  *         @arg @ref LL_AHB1_GRP1_PERIPH_ETH1RX  (*)
  * @endif
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM2
  *         @arg @ref LL_AHB1_GRP1_PERIPH_SRAM1
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_AHB1_GRP1_DisableClockLowPower(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->AHB1LPENR, periphs & LL_AHB1_GRP1_PERIPH_ALL_LPEN_MASK);
}

/**
  * @}
  */ /* End of BUS_LL_EF_AHB1 */

/** @defgroup BUS_LL_EF_AHB2_GRP1_PERIPH AHB2 GRP1 PERIPH
  * @{
  */
/**
  * @brief  Enable AHB2 bus clock.
  * @rmtoll
  *  CFGR2         AHB2DIS         LL_AHB2_EnableBusClock
  */
__STATIC_INLINE void LL_AHB2_EnableBusClock(void)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_CLEAR_BIT_32(RCC->CFGR2, RCC_CFGR2_AHB2DIS);
  tmpreg = STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_AHB2DIS);
  (void)(tmpreg);
}
/**
  * @brief  Check if AHB2 bus clock is enabled.
  * @rmtoll
  *  CFGR2         AHB2DIS         LL_AHB2_IsEnabledBusClock
  * @retval State (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB2_IsEnabledBusClock(void)
{
  return ((STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_AHB2DIS) == 0U) ? 1UL : 0UL);
}

/**
  * @brief  Enable AHB2 peripheral clocks.
  * @rmtoll
  *  AHB2ENR         GPIOAEN         LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         GPIOBEN         LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         GPIOCEN         LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         GPIODEN         LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         GPIOEEN         LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         GPIOFEN         LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         GPIOGEN         LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         GPIOHEN         LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         ADC12EN         LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         DAC1EN          LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         AESEN           LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         HASHEN          LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         RNGEN           LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         PKAEN           LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         SAESEN          LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         CCBEN           LL_AHB2_GRP1_EnableClock \n
  *  AHB2ENR         ADC3EN          LL_AHB2_GRP1_EnableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @if GPIOF
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  * @endif
  * @if GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  * @if AES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES   (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG
  * @if PKA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA   (*)
  * @endif
  * @if SAES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES  (*)
  * @endif
  * @if CCB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB   (*)
  * @endif
  * @if ADC3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC3  (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_AHB2_GRP1_EnableClock(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->AHB2ENR, periphs & LL_AHB2_GRP1_PERIPH_ALL_EN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->AHB2ENR, periphs);
  (void)tmpreg;
}

