MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_bus.h
/**
  * @brief  Check if AHB2 peripheral clock is enabled.
  * @rmtoll
  *  AHB2ENR         GPIOAEN         LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         GPIOBEN         LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         GPIOCEN         LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         GPIODEN         LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         GPIOEEN         LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         GPIOFEN         LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         GPIOGEN         LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         GPIOHEN         LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         ADC12EN         LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         DAC1EN          LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         AESEN           LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         HASHEN          LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         RNGEN           LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         PKAEN           LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         SAESEN          LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         CCBEN           LL_AHB2_GRP1_IsEnabledClock \n
  *  AHB2ENR         ADC3EN          LL_AHB2_GRP1_IsEnabledClock
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @if GPIOF
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  * @endif
  * @if GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  * @if AES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES   (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG
  * @if PKA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA   (*)
  * @endif
  * @if SAES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES  (*)
  * @endif
  * @if CCB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB   (*)
  * @endif
  * @if ADC3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC3  (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB2_GRP1_IsEnabledClock(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->AHB2ENR, periphs & LL_AHB2_GRP1_PERIPH_ALL_EN_MASK) == \
           (periphs & LL_AHB2_GRP1_PERIPH_ALL_EN_MASK)) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB2 bus clock.
  * @rmtoll
  *  CFGR2         AHB2DIS         LL_AHB2_DisableBusClock
  */
__STATIC_INLINE void LL_AHB2_DisableBusClock(void)
{
  STM32_ATOMIC_SET_BIT_32(RCC->CFGR2, RCC_CFGR2_AHB2DIS);
}

/**
  * @brief  Disable AHB2 peripheral clocks.
  * @rmtoll
  *  AHB2ENR         GPIOAEN         LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         GPIOBEN         LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         GPIOCEN         LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         GPIODEN         LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         GPIOEEN         LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         GPIOFEN         LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         GPIOGEN         LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         GPIOHEN         LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         ADC12EN         LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         DAC1EN          LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         AESEN           LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         HASHEN          LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         RNGEN           LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         PKAEN           LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         SAESEN          LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         CCBEN           LL_AHB2_GRP1_DisableClock \n
  *  AHB2ENR         ADC3EN          LL_AHB2_GRP1_DisableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @if GPIOF
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  * @endif
  * @if GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  * @if AES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES   (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG
  * @if PKA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA   (*)
  * @endif
  * @if SAES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES  (*)
  * @endif
  * @if CCB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB   (*)
  * @endif
  * @if ADC3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC3  (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_AHB2_GRP1_DisableClock(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->AHB2ENR, periphs & LL_AHB2_GRP1_PERIPH_ALL_EN_MASK);
}

/**
  * @brief  Force AHB2 peripherals reset.
  * @rmtoll
  *  AHB2RSTR         GPIOARST         LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         GPIOBRST         LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         GPIOCRST         LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         GPIODRST         LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         GPIOERST         LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         GPIOFRST         LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         GPIOGRST         LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         GPIOHRST         LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         ADC12RST         LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         DAC1RST          LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         AESRST           LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         HASHRST          LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         RNGRST           LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         PKARST           LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         SAESRST          LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         CCBRST           LL_AHB2_GRP1_ForceReset \n
  *  AHB2RSTR         ADC3RST          LL_AHB2_GRP1_ForceReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @if GPIOF
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  * @endif
  * @if GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  * @if AES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES   (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG
  * @if PKA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA   (*)
  * @endif
  * @if SAES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES  (*)
  * @endif
  * @if CCB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB   (*)
  * @endif
  * @if ADC3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC3  (*)
  * @endif
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_AHB2_GRP1_ForceReset(uint32_t periphs)
{
  STM32_SET_BIT(RCC->AHB2RSTR, periphs & LL_AHB2_GRP1_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Release AHB2 peripherals reset.
  * @rmtoll
  *  AHB2RSTR         GPIOARST         LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         GPIOBRST         LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         GPIOCRST         LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         GPIODRST         LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         GPIOERST         LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         GPIOFRST         LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         GPIOGRST         LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         GPIOHRST         LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         ADC12RST         LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         DAC1RST          LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         AESRST           LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         HASHRST          LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         RNGRST           LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         PKARST           LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         SAESRST          LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         CCBRST           LL_AHB2_GRP1_ReleaseReset \n
  *  AHB2RSTR         ADC3RST          LL_AHB2_GRP1_ReleaseReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @if GPIOF
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  * @endif
  * @if GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  * @if AES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES   (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG
  * @if PKA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA   (*)
  * @endif
  * @if SAES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES  (*)
  * @endif
  * @if CCB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB   (*)
  * @endif
  * @if ADC3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC3  (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_AHB2_GRP1_ReleaseReset(uint32_t periphs)
{
  STM32_CLEAR_BIT(RCC->AHB2RSTR, periphs & LL_AHB2_GRP1_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Enable AHB2 peripheral clocks in low-power mode.
  * @rmtoll
  *  AHB2LPENR         GPIOALPEN         LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         GPIOBLPEN         LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         GPIOCLPEN         LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         GPIODLPEN         LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         GPIOELPEN         LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         GPIOFLPEN         LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         GPIOGLPEN         LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         GPIOHLPEN         LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         ADC12LPEN         LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         DAC1LPEN          LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         AESLPEN           LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         HASHLPEN          LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         RNGLPEN           LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         PKALPEN           LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         SAESLPEN          LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         CCBLPEN           LL_AHB2_GRP1_EnableClockLowPower \n
  *  AHB2LPENR         ADC3LPEN          LL_AHB2_GRP1_EnableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @if GPIOF
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  * @endif
  * @if GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  * @if AES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES   (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG
  * @if PKA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA   (*)
  * @endif
  * @if SAES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES  (*)
  * @endif
  * @if CCB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB   (*)
  * @endif
  * @if ADC3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC3  (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_AHB2_GRP1_EnableClockLowPower(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->AHB2LPENR, periphs & LL_AHB2_GRP1_PERIPH_ALL_LPEN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->AHB2LPENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB2 peripheral clocks in low-power mode are enabled.
  * @rmtoll
  *  AHB2LPENR         GPIOALPEN         LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         GPIOBLPEN         LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         GPIOCLPEN         LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         GPIODLPEN         LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         GPIOELPEN         LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         GPIOFLPEN         LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         GPIOGLPEN         LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         GPIOHLPEN         LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         ADC12LPEN         LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         DAC1LPEN          LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         AESLPEN           LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         HASHLPEN          LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         RNGLPEN           LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         PKALPEN           LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         SAESLPEN          LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         CCBLPEN           LL_AHB2_GRP1_IsEnabledClockLowPower \n
  *  AHB2LPENR         ADC3LPEN          LL_AHB2_GRP1_IsEnabledClockLowPower
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @if GPIOF
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  * @endif
  * @if GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  * @if AES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES   (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG
  * @if PKA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA   (*)
  * @endif
  * @if SAES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES  (*)
  * @endif
  * @if CCB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB   (*)
  * @endif
  * @if ADC3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC3  (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB2_GRP1_IsEnabledClockLowPower(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->AHB2LPENR, periphs & LL_AHB2_GRP1_PERIPH_ALL_LPEN_MASK) == \
           (periphs & LL_AHB2_GRP1_PERIPH_ALL_LPEN_MASK)) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB2 peripheral clocks in low-power mode.
  * @rmtoll
  *  AHB2LPENR         GPIOALPEN         LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         GPIOBLPEN         LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         GPIOCLPEN         LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         GPIODLPEN         LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         GPIOELPEN         LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         GPIOFLPEN         LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         GPIOGLPEN         LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         GPIOHLPEN         LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         ADC12LPEN         LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         DAC1LPEN          LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         AESLPEN           LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         HASHLPEN          LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         RNGLPEN           LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         PKALPEN           LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         SAESLPEN          LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         CCBLPEN           LL_AHB2_GRP1_DisableClockLowPower \n
  *  AHB2LPENR         ADC3LPEN          LL_AHB2_GRP1_DisableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOD
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOE
  * @if GPIOF
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOF (*)
  * @endif
  * @if GPIOG
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOG (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_GPIOH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC12
  *         @arg @ref LL_AHB2_GRP1_PERIPH_DAC1
  * @if AES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_AES   (*)
  * @endif
  *         @arg @ref LL_AHB2_GRP1_PERIPH_HASH
  *         @arg @ref LL_AHB2_GRP1_PERIPH_RNG
  * @if PKA
  *         @arg @ref LL_AHB2_GRP1_PERIPH_PKA   (*)
  * @endif
  * @if SAES
  *         @arg @ref LL_AHB2_GRP1_PERIPH_SAES  (*)
  * @endif
  * @if CCB
  *         @arg @ref LL_AHB2_GRP1_PERIPH_CCB   (*)
  * @endif
  * @if ADC3
  *         @arg @ref LL_AHB2_GRP1_PERIPH_ADC3  (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_AHB2_GRP1_DisableClockLowPower(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->AHB2LPENR, periphs & LL_AHB2_GRP1_PERIPH_ALL_LPEN_MASK);
}

/**
  * @}
  */ /* End of BUS_LL_EF_AHB2 */

#if defined(AHB4PERIPH_BASE)
/** @defgroup BUS_LL_EF_AHB4_GRP1_PERIPH AHB4 GRP1 PERIPH
  * @{
  */
/**
  * @brief  Enable AHB4 bus clock.
  * @rmtoll
  *  CFGR2         AHB4DIS         LL_AHB4_EnableBusClock
  */
__STATIC_INLINE void LL_AHB4_EnableBusClock(void)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_CLEAR_BIT_32(RCC->CFGR2, RCC_CFGR2_AHB4DIS);
  tmpreg = STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_AHB4DIS);
  (void)(tmpreg);
}
/**
  * @brief  Check if AHB4 bus clock is enabled.
  * @rmtoll
  *  CFGR2         AHB4DIS         LL_AHB4_IsEnabledBusClock
  * @retval State (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB4_IsEnabledBusClock(void)
{
  return ((STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_AHB4DIS) == 0U) ? 1UL : 0UL);
}

/**
  * @brief  Enable AHB4 peripheral clocks.
  * @rmtoll
  *  AHB4ENR         XSPI1EN         LL_AHB4_GRP1_EnableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_XSPI1
  */
__STATIC_INLINE void LL_AHB4_GRP1_EnableClock(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->AHB4ENR, periphs & LL_AHB4_GRP1_PERIPH_ALL_EN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->AHB4ENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB4 peripheral clock is enabled.
  * @rmtoll
  *  AHB4ENR         XSPI1EN         LL_AHB4_GRP1_IsEnabledClock
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_XSPI1
  *
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB4_GRP1_IsEnabledClock(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->AHB4ENR, periphs & LL_AHB4_GRP1_PERIPH_ALL_EN_MASK) == \
           (periphs & LL_AHB4_GRP1_PERIPH_ALL_EN_MASK)) ? 1UL : 0UL);
}

/**
  * @brief  Disable AHB4 bus clock.
  * @rmtoll
  *  CFGR2         AHB4DIS         LL_AHB4_DisableBusClock
  */
__STATIC_INLINE void LL_AHB4_DisableBusClock(void)
{
  STM32_ATOMIC_SET_BIT_32(RCC->CFGR2, RCC_CFGR2_AHB4DIS);
}

/**
  * @brief  Disable AHB4 peripheral clocks.
  * @rmtoll
  *  AHB4ENR         XSPI1EN         LL_AHB4_GRP1_DisableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_XSPI1
  */
__STATIC_INLINE void LL_AHB4_GRP1_DisableClock(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->AHB4ENR, periphs & LL_AHB4_GRP1_PERIPH_ALL_EN_MASK);
}

/**
  * @brief  Force AHB4 peripherals reset.
  * @rmtoll
  *  AHB4RSTR         XSPI1RST         LL_AHB4_GRP1_ForceReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_XSPI1
  */
__STATIC_INLINE void LL_AHB4_GRP1_ForceReset(uint32_t periphs)
{
  STM32_SET_BIT(RCC->AHB4RSTR, periphs & LL_AHB4_GRP1_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Release AHB4 peripherals reset.
  * @rmtoll
  *  AHB4RSTR         XSPI1RST         LL_AHB4_GRP1_ReleaseReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_XSPI1
  */
__STATIC_INLINE void LL_AHB4_GRP1_ReleaseReset(uint32_t periphs)
{
  STM32_CLEAR_BIT(RCC->AHB4RSTR, periphs & LL_AHB4_GRP1_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Enable AHB4 peripheral clocks in low-power mode.
  * @rmtoll
  *  AHB4LPENR         XSPI1LPEN         LL_AHB4_GRP1_EnableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_XSPI1
  */
__STATIC_INLINE void LL_AHB4_GRP1_EnableClockLowPower(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->AHB4LPENR, periphs & LL_AHB4_GRP1_PERIPH_ALL_LPEN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->AHB4LPENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if AHB4 peripheral clocks in low-power mode are enabled.
  * @rmtoll
  *  AHB4LPENR         XSPI1LPEN         LL_AHB4_GRP1_IsEnabledClockLowPower
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_XSPI1
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_AHB4_GRP1_IsEnabledClockLowPower(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->AHB4LPENR, periphs & LL_AHB4_GRP1_PERIPH_ALL_LPEN_MASK) == \
           (periphs & LL_AHB4_GRP1_PERIPH_ALL_LPEN_MASK)) ? 1UL : 0UL);
}

