MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_bus.h
/**
  * @brief  Disable AHB4 peripheral clocks in low-power mode.
  * @rmtoll
  *  AHB4LPENR         XSPI1LPEN         LL_AHB4_GRP1_DisableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_AHB4_GRP1_PERIPH_ALL
  *         @arg @ref LL_AHB4_GRP1_PERIPH_XSPI1
  */
__STATIC_INLINE void LL_AHB4_GRP1_DisableClockLowPower(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->AHB4LPENR, periphs & LL_AHB4_GRP1_PERIPH_ALL_LPEN_MASK);
}

/**
  * @}
  */ /* End of BUS_LL_EF_AHB4 */
#endif /* AHB4PERIPH_BASE */

/** @defgroup BUS_LL_EF_APB1 APB1
  * @{
  */
/**
  * @brief  Enable APB1 bus clock.
  * @rmtoll
  *  CFGR2         APB1DIS         LL_APB1_EnableBusClock
  */
__STATIC_INLINE void LL_APB1_EnableBusClock(void)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_CLEAR_BIT_32(RCC->CFGR2, RCC_CFGR2_APB1DIS);
  tmpreg = STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_APB1DIS);
  (void)(tmpreg);
}
/**
  * @brief  Check if APB1 bus clock is enabled.
  * @rmtoll
  *  CFGR2         APB1DIS         LL_APB1_IsEnabledBusClock
  * @retval State (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_IsEnabledBusClock(void)
{
  return ((STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_APB1DIS) == 0U) ? 1UL : 0UL);
}

/**
  * @brief  Enable APB1 peripheral clocks.
  * @rmtoll
  *  APB1LENR         TIM2EN           LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         TIM3EN           LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         TIM4EN           LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         TIM5EN           LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         TIM6EN           LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         TIM7EN           LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         TIM12EN          LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         WWDGEN           LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         OPAMP1EN         LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         SPI2EN           LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         SPI3EN           LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         USART2EN         LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         USART3EN         LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         UART4EN          LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         UART5EN          LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         I2C1EN           LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         I2C2EN           LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         I3C1EN           LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         CRSEN            LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         USART6EN         LL_APB1_GRP1_EnableClock \n
  *  APB1LENR         UART7EN          LL_APB1_GRP1_EnableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  * @if TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3    (*)
  * @endif
  * @if TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4    (*)
  * @endif
  * @if TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  * @if OPAMP1
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP1  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  * @if SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  * @if USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  * @if I2C
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  * @if USART6
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART6  (*)
  * @endif
  * @if UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7   (*)
  * @endif
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClock(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->APB1LENR, periphs & LL_APB1_GRP1_PERIPH_ALL_EN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->APB1LENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clock is enabled.
  * @rmtoll
  *  APB1LENR         TIM2EN           LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         TIM3EN           LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         TIM4EN           LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         TIM5EN           LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         TIM6EN           LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         TIM7EN           LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         TIM12EN          LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         WWDGEN           LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         OPAMP1EN         LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         SPI2EN           LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         SPI3EN           LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         USART2EN         LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         USART3EN         LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         UART4EN          LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         UART5EN          LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         I2C1EN           LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         I2C2EN           LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         I3C1EN           LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         CRSEN            LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         USART6EN         LL_APB1_GRP1_IsEnabledClock \n
  *  APB1LENR         UART7EN          LL_APB1_GRP1_IsEnabledClock
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  * @if TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3    (*)
  * @endif
  * @if TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4    (*)
  * @endif
  * @if TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  * @if OPAMP1
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP1  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  * @if SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  * @if USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  * @if I2C
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  * @if USART6
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART6  (*)
  * @endif
  * @if UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7   (*)
  * @endif
  *
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClock(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->APB1LENR, periphs & LL_APB1_GRP1_PERIPH_ALL_EN_MASK) == \
           (periphs & LL_APB1_GRP1_PERIPH_ALL_EN_MASK)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 bus clock.
  * @rmtoll
  * CFGR2         APB1DIS         LL_APB1_DisableBusClock
  */
__STATIC_INLINE void LL_APB1_DisableBusClock(void)
{
  STM32_ATOMIC_SET_BIT_32(RCC->CFGR2, RCC_CFGR2_APB1DIS);
}

/**
  * @brief  Disable APB1 peripheral clocks.
  * @rmtoll
  *  APB1LENR         TIM2EN           LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         TIM3EN           LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         TIM4EN           LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         TIM5EN           LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         TIM6EN           LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         TIM7EN           LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         TIM12EN          LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         WWDGEN           LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         OPAMP1EN         LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         SPI2EN           LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         SPI3EN           LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         USART2EN         LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         USART3EN         LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         UART4EN          LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         UART5EN          LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         I2C1EN           LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         I2C2EN           LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         I3C1EN           LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         CRSEN            LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         USART6EN         LL_APB1_GRP1_DisableClock \n
  *  APB1LENR         UART7EN          LL_APB1_GRP1_DisableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  * @if TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3    (*)
  * @endif
  * @if TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4    (*)
  * @endif
  * @if TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  * @if OPAMP1
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP1  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  * @if SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  * @if USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  * @if I2C
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  * @if USART6
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART6  (*)
  * @endif
  * @if UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7   (*)
  * @endif
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClock(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->APB1LENR, periphs & LL_APB1_GRP1_PERIPH_ALL_EN_MASK);
}

/**
  * @brief  Force APB1 peripherals reset.
  * @rmtoll
  *  APB1LRSTR         TIM2RST           LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         TIM3RST           LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         TIM4RST           LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         TIM5RST           LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         TIM6RST           LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         TIM7RST           LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         TIM12RST          LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         OPAMP1RST         LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         SPI2RST           LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         SPI3RST           LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         USART2RST         LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         USART3RST         LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         UART4RST          LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         UART5RST          LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         I2C1RST           LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         I2C2RST           LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         I3C1RST           LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         CRSRST            LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         USART6RST         LL_APB1_GRP1_ForceReset \n
  *  APB1LRSTR         UART7RST          LL_APB1_GRP1_ForceReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  * @if TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3    (*)
  * @endif
  * @if TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4    (*)
  * @endif
  * @if TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  * @if OPAMP1
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP1  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  * @if SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  * @if USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  * @if I2C
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  * @if USART6
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART6  (*)
  * @endif
  * @if UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7   (*)
  * @endif
  */
__STATIC_INLINE void LL_APB1_GRP1_ForceReset(uint32_t periphs)
{
  STM32_SET_BIT(RCC->APB1LRSTR, periphs & LL_APB1_GRP1_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Release APB1 peripherals reset.
  * @rmtoll
  *  APB1LRSTR         TIM2RST           LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         TIM3RST           LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         TIM4RST           LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         TIM5RST           LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         TIM6RST           LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         TIM7RST           LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         TIM12RST          LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         OPAMP1RST         LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         SPI2RST           LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         SPI3RST           LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         USART2RST         LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         USART3RST         LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         UART4RST          LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         UART5RST          LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         I2C1RST           LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         I2C2RST           LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         I3C1RST           LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         CRSRST            LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         USART6RST         LL_APB1_GRP1_ReleaseReset \n
  *  APB1LRSTR         UART7RST          LL_APB1_GRP1_ReleaseReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  * @if TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3    (*)
  * @endif
  * @if TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4    (*)
  * @endif
  * @if TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  * @if OPAMP1
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP1  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  * @if SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  * @if USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  * @if I2C
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  * @if USART6
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART6  (*)
  * @endif
  * @if UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7   (*)
  * @endif
  */
__STATIC_INLINE void LL_APB1_GRP1_ReleaseReset(uint32_t periphs)
{
  STM32_CLEAR_BIT(RCC->APB1LRSTR, periphs & LL_APB1_GRP1_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Enable APB1 peripheral clocks in low-power mode.
  * @rmtoll
  *  APB1LLPENR         TIM2LPEN           LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         TIM3LPEN           LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         TIM4LPEN           LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         TIM5LPEN           LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         TIM6LPEN           LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         TIM7LPEN           LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         TIM12LPEN          LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         WWDGLPEN           LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         OPAMP1LPEN         LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         SPI2LPEN           LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         SPI3LPEN           LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         USART2LPEN         LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         USART3LPEN         LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         UART4LPEN          LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         UART5LPEN          LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         I2C1LPEN           LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         I2C2LPEN           LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         I3C1LPEN           LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         CRSLPEN            LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         USART6LPEN         LL_APB1_GRP1_EnableClockLowPower \n
  *  APB1LLPENR         UART7LPEN          LL_APB1_GRP1_EnableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  * @if TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3    (*)
  * @endif
  * @if TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4    (*)
  * @endif
  * @if TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  * @if OPAMP1
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP1  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  * @if SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  * @if USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  * @if I2C
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  * @if USART6
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART6  (*)
  * @endif
  * @if UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7   (*)
  * @endif
  */
__STATIC_INLINE void LL_APB1_GRP1_EnableClockLowPower(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->APB1LLPENR, periphs & LL_APB1_GRP1_PERIPH_ALL_LPEN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->APB1LLPENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clocks in low-power mode are enabled.
  * @rmtoll
  *  APB1LLPENR         TIM2LPEN           LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         TIM3LPEN           LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         TIM4LPEN           LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         TIM5LPEN           LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         TIM6LPEN           LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         TIM7LPEN           LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         TIM12LPEN          LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         WWDGLPEN           LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         OPAMP1LPEN         LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         SPI2LPEN           LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         SPI3LPEN           LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         USART2LPEN         LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         USART3LPEN         LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         UART4LPEN          LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         UART5LPEN          LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         I2C1LPEN           LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         I2C2LPEN           LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         I3C1LPEN           LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         CRSLPEN            LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         USART6LPEN         LL_APB1_GRP1_IsEnabledClockLowPower \n
  *  APB1LLPENR         UART7LPEN          LL_APB1_GRP1_IsEnabledClockLowPower
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  * @if TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3    (*)
  * @endif
  * @if TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4    (*)
  * @endif
  * @if TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  * @if OPAMP1
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP1  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  * @if SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  * @if USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  * @if I2C
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  * @if USART6
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART6  (*)
  * @endif
  * @if UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7   (*)
  * @endif
  *
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP1_IsEnabledClockLowPower(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->APB1LLPENR, periphs & LL_APB1_GRP1_PERIPH_ALL_LPEN_MASK) == \
           (periphs & LL_APB1_GRP1_PERIPH_ALL_LPEN_MASK)) ? 1UL : 0UL);
}

