MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_bus.h
/**
  * @brief  Disable APB1 peripheral clocks in low-power mode.
  * @rmtoll
  *  APB1LLPENR         TIM2LPEN           LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         TIM3LPEN           LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         TIM4LPEN           LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         TIM5LPEN           LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         TIM6LPEN           LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         TIM7LPEN           LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         TIM12LPEN          LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         WWDGLPEN           LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         OPAMP1LPEN         LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         SPI2LPEN           LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         SPI3LPEN           LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         USART2LPEN         LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         USART3LPEN         LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         UART4LPEN          LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         UART5LPEN          LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         I2C1LPEN           LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         I2C2LPEN           LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         I3C1LPEN           LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         CRSLPEN            LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         USART6LPEN         LL_APB1_GRP1_DisableClockLowPower \n
  *  APB1LLPENR         UART7LPEN          LL_APB1_GRP1_DisableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  * @if TIM3
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3    (*)
  * @endif
  * @if TIM4
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM4    (*)
  * @endif
  * @if TIM5
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM5    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM12
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  * @if OPAMP1
  *         @arg @ref LL_APB1_GRP1_PERIPH_OPAMP1  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2
  * @if SPI3
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI3    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  * @if USART3
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART3  (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART4
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART5
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  * @if I2C
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2    (*)
  * @endif
  *         @arg @ref LL_APB1_GRP1_PERIPH_I3C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS
  * @if USART6
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART6  (*)
  * @endif
  * @if UART7
  *         @arg @ref LL_APB1_GRP1_PERIPH_UART7   (*)
  * @endif
  */
__STATIC_INLINE void LL_APB1_GRP1_DisableClockLowPower(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->APB1LLPENR, periphs & LL_APB1_GRP1_PERIPH_ALL_LPEN_MASK);
}

/**
  * @brief  Enable APB1 peripheral clocks.
  * @rmtoll
  *  APB1HENR         COMP12EN        LL_APB1_GRP2_EnableClock \n
  *  APB1HENR         FDCANEN         LL_APB1_GRP2_EnableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP12
  * @if FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_APB1_GRP2_EnableClock(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->APB1HENR, periphs & LL_APB1_GRP2_PERIPH_ALL_EN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->APB1HENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clock is enabled.
  * @rmtoll
  *  APB1HENR         COMP12EN        LL_APB1_GRP2_IsEnabledClock \n
  *  APB1HENR         FDCANEN         LL_APB1_GRP2_IsEnabledClock
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP12
  * @if FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP2_IsEnabledClock(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->APB1HENR, periphs & LL_APB1_GRP2_PERIPH_ALL_EN_MASK) == \
           (periphs & LL_APB1_GRP2_PERIPH_ALL_EN_MASK)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 peripheral clocks.
  * @rmtoll
  *  APB1HENR         COMP12EN        LL_APB1_GRP2_DisableClock \n
  *  APB1HENR         FDCANEN         LL_APB1_GRP2_DisableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP12
  * @if FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_APB1_GRP2_DisableClock(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->APB1HENR, periphs & LL_APB1_GRP2_PERIPH_ALL_EN_MASK);
}

/**
  * @brief  Force APB1 peripherals reset.
  * @rmtoll
  *  APB1HRSTR         COMP12RST        LL_APB1_GRP2_ForceReset \n
  *  APB1HRSTR         FDCANRST         LL_APB1_GRP2_ForceReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP12
  * @if FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_APB1_GRP2_ForceReset(uint32_t periphs)
{
  STM32_SET_BIT(RCC->APB1HRSTR, periphs & LL_APB1_GRP2_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Release APB1 peripherals reset.
  * @rmtoll
  *  APB1HRSTR         COMP12RST        LL_APB1_GRP2_ReleaseReset \n
  *  APB1HRSTR         FDCANRST         LL_APB1_GRP2_ReleaseReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP12
  * @if FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_APB1_GRP2_ReleaseReset(uint32_t periphs)
{
  STM32_CLEAR_BIT(RCC->APB1HRSTR, periphs & LL_APB1_GRP2_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Enable APB1 peripheral clocks in low-power mode.
  * @rmtoll
  *  APB1HLPENR         COMP12LPEN        LL_APB1_GRP2_EnableClockLowPower \n
  *  APB1HLPENR         FDCANLPEN         LL_APB1_GRP2_EnableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP12
  * @if FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_APB1_GRP2_EnableClockLowPower(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->APB1HLPENR, periphs & LL_APB1_GRP2_PERIPH_ALL_LPEN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->APB1HLPENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB1 peripheral clocks in low-power mode are enabled.
  * @rmtoll
  *  APB1HLPENR         COMP12LPEN        LL_APB1_GRP2_IsEnabledClockLowPower \n
  *  APB1HLPENR         FDCANLPEN         LL_APB1_GRP2_IsEnabledClockLowPower
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP12
  * @if FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB1_GRP2_IsEnabledClockLowPower(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->APB1HLPENR, periphs & LL_APB1_GRP2_PERIPH_ALL_LPEN_MASK) == \
           (periphs & LL_APB1_GRP2_PERIPH_ALL_LPEN_MASK)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB1 peripheral clocks in low-power mode.
  * @rmtoll
  *  APB1HLPENR         COMP12LPEN        LL_APB1_GRP2_DisableClockLowPower \n
  *  APB1HLPENR         FDCANLPEN         LL_APB1_GRP2_DisableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP2_PERIPH_ALL
  *         @arg @ref LL_APB1_GRP2_PERIPH_COMP12
  * @if FDCAN
  *         @arg @ref LL_APB1_GRP2_PERIPH_FDCAN (*)
  * @endif
  *
  *        (*) value not defined in all devices.
  */
__STATIC_INLINE void LL_APB1_GRP2_DisableClockLowPower(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->APB1HLPENR, periphs & LL_APB1_GRP2_PERIPH_ALL_LPEN_MASK);
}

/**
  * @}
  */ /* End of BUS_LL_EF_APB1 */

/** @defgroup BUS_LL_EF_APB2 APB2
  * @{
  */
/**
  * @brief  Enable APB2 bus clock.
  * @rmtoll CFGR2         APB2DIS         LL_APB2_EnableBusClock
  */
__STATIC_INLINE void LL_APB2_EnableBusClock(void)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_CLEAR_BIT_32(RCC->CFGR2, RCC_CFGR2_APB2DIS);
  tmpreg = STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_APB2DIS);
  (void)(tmpreg);
}
/**
  * @brief  Check if APB2 bus clock is enabled.
  * @rmtoll CFGR2         APB2DIS         LL_APB2_IsEnabledBusClock
  * @retval State (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB2_IsEnabledBusClock(void)
{
  return ((STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_APB2DIS) == 0U) ? 1UL : 0UL);
}

/**
  * @brief  Enable APB2 peripheral clocks.
  * @rmtoll
  *  APB2ENR         TIM1EN           LL_APB2_GRP1_EnableClock \n
  *  APB2ENR         SPI1EN           LL_APB2_GRP1_EnableClock \n
  *  APB2ENR         TIM8EN           LL_APB2_GRP1_EnableClock \n
  *  APB2ENR         USART1EN         LL_APB2_GRP1_EnableClock \n
  *  APB2ENR         TIM15EN          LL_APB2_GRP1_EnableClock \n
  *  APB2ENR         TIM16EN          LL_APB2_GRP1_EnableClock \n
  *  APB2ENR         TIM17EN          LL_APB2_GRP1_EnableClock \n
  *  APB2ENR         USBEN            LL_APB2_GRP1_EnableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  * @if PLAY1
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1APB (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  * @if TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 (*)
  * @endif
  * @if TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_USB
  */
__STATIC_INLINE void LL_APB2_GRP1_EnableClock(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->APB2ENR, periphs & LL_APB2_GRP1_PERIPH_ALL_EN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->APB2ENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB2 peripheral clock is enabled.
  * @rmtoll
  *  APB2ENR         TIM1EN           LL_APB2_GRP1_IsEnabledClock \n
  *  APB2ENR         SPI1EN           LL_APB2_GRP1_IsEnabledClock \n
  *  APB2ENR         TIM8EN           LL_APB2_GRP1_IsEnabledClock \n
  *  APB2ENR         USART1EN         LL_APB2_GRP1_IsEnabledClock \n
  *  APB2ENR         TIM15EN          LL_APB2_GRP1_IsEnabledClock \n
  *  APB2ENR         TIM16EN          LL_APB2_GRP1_IsEnabledClock \n
  *  APB2ENR         TIM17EN          LL_APB2_GRP1_IsEnabledClock \n
  *  APB2ENR         USBEN            LL_APB2_GRP1_IsEnabledClock
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  * @if PLAY1
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1APB (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  * @if TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 (*)
  * @endif
  * @if TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_USB
  *
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB2_GRP1_IsEnabledClock(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->APB2ENR, periphs & LL_APB2_GRP1_PERIPH_ALL_EN_MASK) == \
           (periphs & LL_APB2_GRP1_PERIPH_ALL_EN_MASK)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB2 bus clock.
  * @rmtoll CFGR2         APB2DIS         LL_APB2_DisableBusClock
  */
__STATIC_INLINE void LL_APB2_DisableBusClock(void)
{
  STM32_ATOMIC_SET_BIT_32(RCC->CFGR2, RCC_CFGR2_APB2DIS);
}

/**
  * @brief  Disable APB2 peripheral clocks.
  * @rmtoll
  *  APB2ENR         TIM1EN           LL_APB2_GRP1_DisableClock \n
  *  APB2ENR         SPI1EN           LL_APB2_GRP1_DisableClock \n
  *  APB2ENR         TIM8EN           LL_APB2_GRP1_DisableClock \n
  *  APB2ENR         USART1EN         LL_APB2_GRP1_DisableClock \n
  *  APB2ENR         TIM15EN          LL_APB2_GRP1_DisableClock \n
  *  APB2ENR         TIM16EN          LL_APB2_GRP1_DisableClock \n
  *  APB2ENR         TIM17EN          LL_APB2_GRP1_DisableClock \n
  *  APB2ENR         USBEN            LL_APB2_GRP1_DisableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  * @if PLAY1
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1APB (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  * @if TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 (*)
  * @endif
  * @if TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_USB
  */
__STATIC_INLINE void LL_APB2_GRP1_DisableClock(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->APB2ENR, periphs & LL_APB2_GRP1_PERIPH_ALL_EN_MASK);
}

/**
  * @brief  Force APB2 peripherals reset.
  * @rmtoll
  *  APB2RSTR         TIM1RST           LL_APB2_GRP1_ForceReset \n
  *  APB2RSTR         SPI1RST           LL_APB2_GRP1_ForceReset \n
  *  APB2RSTR         TIM8RST           LL_APB2_GRP1_ForceReset \n
  *  APB2RSTR         USART1RST         LL_APB2_GRP1_ForceReset \n
  *  APB2RSTR         TIM15RST          LL_APB2_GRP1_ForceReset \n
  *  APB2RSTR         TIM16RST          LL_APB2_GRP1_ForceReset \n
  *  APB2RSTR         TIM17RST          LL_APB2_GRP1_ForceReset \n
  *  APB2RSTR         USBRST            LL_APB2_GRP1_ForceReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  * @if PLAY1
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1GLOBAL (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1APP (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  * @if TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 (*)
  * @endif
  * @if TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_USB
  */
__STATIC_INLINE void LL_APB2_GRP1_ForceReset(uint32_t periphs)
{
  STM32_SET_BIT(RCC->APB2RSTR, periphs & LL_APB2_GRP1_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Release APB2 peripherals reset.
  * @rmtoll
  *  APB2RSTR         TIM1RST           LL_APB2_GRP1_ReleaseReset \n
  *  APB2RSTR         SPI1RST           LL_APB2_GRP1_ReleaseReset \n
  *  APB2RSTR         TIM8RST           LL_APB2_GRP1_ReleaseReset \n
  *  APB2RSTR         USART1RST         LL_APB2_GRP1_ReleaseReset \n
  *  APB2RSTR         TIM15RST          LL_APB2_GRP1_ReleaseReset \n
  *  APB2RSTR         TIM16RST          LL_APB2_GRP1_ReleaseReset \n
  *  APB2RSTR         TIM17RST          LL_APB2_GRP1_ReleaseReset \n
  *  APB2RSTR         USBRST            LL_APB2_GRP1_ReleaseReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  * @if PLAY1
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1GLOBAL (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1APP (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  * @if TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 (*)
  * @endif
  * @if TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_USB
  */
__STATIC_INLINE void LL_APB2_GRP1_ReleaseReset(uint32_t periphs)
{
  STM32_CLEAR_BIT(RCC->APB2RSTR, periphs & LL_APB2_GRP1_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Enable APB2 peripheral clocks in low-power mode.
  * @rmtoll
  *  APB2LPENR         TIM1LPEN           LL_APB2_GRP1_EnableClockLowPower \n
  *  APB2LPENR         SPI1LPEN           LL_APB2_GRP1_EnableClockLowPower \n
  *  APB2LPENR         TIM8LPEN           LL_APB2_GRP1_EnableClockLowPower \n
  *  APB2LPENR         USART1LPEN         LL_APB2_GRP1_EnableClockLowPower \n
  *  APB2LPENR         TIM15LPEN          LL_APB2_GRP1_EnableClockLowPower \n
  *  APB2LPENR         TIM16LPEN          LL_APB2_GRP1_EnableClockLowPower \n
  *  APB2LPENR         TIM17LPEN          LL_APB2_GRP1_EnableClockLowPower \n
  *  APB2LPENR         USBLPEN            LL_APB2_GRP1_EnableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  * @if PLAY1
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  * @if TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 (*)
  * @endif
  * @if TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_USB
  */
__STATIC_INLINE void LL_APB2_GRP1_EnableClockLowPower(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->APB2LPENR, periphs & LL_APB2_GRP1_PERIPH_ALL_LPEN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->APB2LPENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB2 peripheral clocks in low-power mode are enabled.
  * @rmtoll
  *  APB2LPENR         TIM1LPEN           LL_APB2_GRP1_IsEnabledClockLowPower \n
  *  APB2LPENR         SPI1LPEN           LL_APB2_GRP1_IsEnabledClockLowPower \n
  *  APB2LPENR         TIM8LPEN           LL_APB2_GRP1_IsEnabledClockLowPower \n
  *  APB2LPENR         USART1LPEN         LL_APB2_GRP1_IsEnabledClockLowPower \n
  *  APB2LPENR         TIM15LPEN          LL_APB2_GRP1_IsEnabledClockLowPower \n
  *  APB2LPENR         TIM16LPEN          LL_APB2_GRP1_IsEnabledClockLowPower \n
  *  APB2LPENR         TIM17LPEN          LL_APB2_GRP1_IsEnabledClockLowPower \n
  *  APB2LPENR         USBLPEN            LL_APB2_GRP1_IsEnabledClockLowPower
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  * @if PLAY1
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  * @if TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 (*)
  * @endif
  * @if TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_USB
  *
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB2_GRP1_IsEnabledClockLowPower(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->APB2LPENR, periphs & LL_APB2_GRP1_PERIPH_ALL_LPEN_MASK) == \
           (periphs & LL_APB2_GRP1_PERIPH_ALL_LPEN_MASK)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB2 peripheral clocks in low-power mode.
  * @rmtoll
  *  APB2LPENR         TIM1LPEN           LL_APB2_GRP1_DisableClockLowPower \n
  *  APB2LPENR         SPI1LPEN           LL_APB2_GRP1_DisableClockLowPower \n
  *  APB2LPENR         TIM8LPEN           LL_APB2_GRP1_DisableClockLowPower \n
  *  APB2LPENR         USART1LPEN         LL_APB2_GRP1_DisableClockLowPower \n
  *  APB2LPENR         TIM15LPEN          LL_APB2_GRP1_DisableClockLowPower \n
  *  APB2LPENR         TIM16LPEN          LL_APB2_GRP1_DisableClockLowPower \n
  *  APB2LPENR         TIM17LPEN          LL_APB2_GRP1_DisableClockLowPower \n
  *  APB2LPENR         USBLPEN            LL_APB2_GRP1_DisableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  * @if PLAY1
  *         @arg @ref LL_APB2_GRP1_PERIPH_PLAY1 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15
  * @if TIM16
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 (*)
  * @endif
  * @if TIM17
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 (*)
  * @endif
  *         @arg @ref LL_APB2_GRP1_PERIPH_USB
  */
__STATIC_INLINE void LL_APB2_GRP1_DisableClockLowPower(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->APB2LPENR, periphs & LL_APB2_GRP1_PERIPH_ALL_LPEN_MASK);
}

/**
  * @}
  */ /* End of BUS_LL_EF_APB2 */


/** @defgroup BUS_LL_EF_APB3 APB3
  * @{
  */
/**
  * @brief  Enable APB3 bus clock.
  * @rmtoll CFGR2         APB3DIS         LL_APB3_EnableBusClock
  */
__STATIC_INLINE void LL_APB3_EnableBusClock(void)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_CLEAR_BIT_32(RCC->CFGR2, RCC_CFGR2_APB3DIS);
  tmpreg = STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_APB3DIS);
  (void)(tmpreg);
}
/**
  * @brief  Check if APB3 bus clock is enabled.
  * @rmtoll
  *  CFGR2         APB3DIS         LL_APB3_IsEnabledBusClock
  * @retval State (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB3_IsEnabledBusClock(void)
{
  return ((STM32_READ_BIT(RCC->CFGR2, RCC_CFGR2_APB3DIS) == 0U) ? 1UL : 0UL);
}

