MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_bus.h
/**
  * @brief  Enable APB3 peripheral clocks.
  * @rmtoll
  *  APB3ENR         SBSEN             LL_APB3_GRP1_EnableClock \n
  *  APB3ENR         LPUART1EN         LL_APB3_GRP1_EnableClock \n
  *  APB3ENR         LPTIM1EN          LL_APB3_GRP1_EnableClock \n
  *  APB3ENR         RTCAPBEN          LL_APB3_GRP1_EnableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB3_GRP1_PERIPH_SBS
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB3_GRP1_PERIPH_RTCAPB
  */
__STATIC_INLINE void LL_APB3_GRP1_EnableClock(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->APB3ENR, periphs & LL_APB3_GRP1_PERIPH_ALL_EN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->APB3ENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB3 peripheral clock is enabled.
  * @rmtoll
  *  APB3ENR         SBSEN             LL_APB3_GRP1_IsEnabledClock \n
  *  APB3ENR         LPUART1EN         LL_APB3_GRP1_IsEnabledClock \n
  *  APB3ENR         LPTIM1EN          LL_APB3_GRP1_IsEnabledClock \n
  *  APB3ENR         RTCAPBEN          LL_APB3_GRP1_IsEnabledClock
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB3_GRP1_PERIPH_SBS
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB3_GRP1_PERIPH_RTCAPB
  *
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB3_GRP1_IsEnabledClock(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->APB3ENR, periphs & LL_APB3_GRP1_PERIPH_ALL_EN_MASK) == \
           (periphs & LL_APB3_GRP1_PERIPH_ALL_EN_MASK)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB3 bus clock.
  * @rmtoll
  *  CFGR2         APB3DIS         LL_APB3_DisableBusClock
  */
__STATIC_INLINE void LL_APB3_DisableBusClock(void)
{
  STM32_ATOMIC_SET_BIT_32(RCC->CFGR2, RCC_CFGR2_APB3DIS);
}

/**
  * @brief  Disable APB3 peripheral clocks.
  * @rmtoll
  *  APB3ENR         SBSEN             LL_APB3_GRP1_DisableClock  \n
  *  APB3ENR         LPUART1EN         LL_APB3_GRP1_DisableClock  \n
  *  APB3ENR         LPTIM1EN          LL_APB3_GRP1_DisableClock  \n
  *  APB3ENR         RTCAPBEN          LL_APB3_GRP1_DisableClock
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB3_GRP1_PERIPH_SBS
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB3_GRP1_PERIPH_RTCAPB
  */
__STATIC_INLINE void LL_APB3_GRP1_DisableClock(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->APB3ENR, periphs & LL_APB3_GRP1_PERIPH_ALL_EN_MASK);
}

/**
  * @brief  Force APB3 peripherals reset.
  * @rmtoll
  *  APB3RSTR         SBSRST             LL_APB3_GRP1_ForceReset  \n
  *  APB3RSTR         LPUART1RST         LL_APB3_GRP1_ForceReset  \n
  *  APB3RSTR         LPTIM1RST          LL_APB3_GRP1_ForceReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB3_GRP1_PERIPH_SBS
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM1
  */
__STATIC_INLINE void LL_APB3_GRP1_ForceReset(uint32_t periphs)
{
  STM32_SET_BIT(RCC->APB3RSTR, periphs & LL_APB3_GRP1_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Release APB3 peripherals reset.
  * @rmtoll
  *  APB3RSTR         SBSRST             LL_APB3_GRP1_ReleaseReset \n
  *  APB3RSTR         LPUART1RST         LL_APB3_GRP1_ReleaseReset \n
  *  APB3RSTR         LPTIM1RST          LL_APB3_GRP1_ReleaseReset
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB3_GRP1_PERIPH_SBS
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM1
  */
__STATIC_INLINE void LL_APB3_GRP1_ReleaseReset(uint32_t periphs)
{
  STM32_CLEAR_BIT(RCC->APB3RSTR, periphs & LL_APB3_GRP1_PERIPH_ALL_RST_MASK);
}

/**
  * @brief  Enable APB3 peripheral clocks in low-power mode.
  * @rmtoll
  *  APB3LPENR         SBSLPEN             LL_APB3_GRP1_EnableClockLowPower \n
  *  APB3LPENR         LPUART1LPEN         LL_APB3_GRP1_EnableClockLowPower \n
  *  APB3LPENR         LPTIM1LPEN          LL_APB3_GRP1_EnableClockLowPower \n
  *  APB3LPENR         RTCAPBLPEN          LL_APB3_GRP1_EnableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB3_GRP1_PERIPH_SBS
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB3_GRP1_PERIPH_RTCAPB
  */
__STATIC_INLINE void LL_APB3_GRP1_EnableClockLowPower(uint32_t periphs)
{
  __IO uint32_t tmpreg;
  STM32_ATOMIC_SET_BIT_32(RCC->APB3LPENR, periphs & LL_APB3_GRP1_PERIPH_ALL_LPEN_MASK);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = STM32_READ_BIT(RCC->APB3LPENR, periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB3 peripheral clocks in low-power mode are enabled.
  * @rmtoll
  *  APB3LPENR         SBSLPEN             LL_APB3_GRP1_IsEnabledClockLowPower \n
  *  APB3LPENR         LPUART1LPEN         LL_APB3_GRP1_IsEnabledClockLowPower \n
  *  APB3LPENR         LPTIM1LPEN          LL_APB3_GRP1_IsEnabledClockLowPower \n
  *  APB3LPENR         RTCAPBLPEN          LL_APB3_GRP1_IsEnabledClockLowPower
  * @param  periphs This parameter can be a one of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB3_GRP1_PERIPH_SBS
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB3_GRP1_PERIPH_RTCAPB
  *
  * @retval State of periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB3_GRP1_IsEnabledClockLowPower(uint32_t periphs)
{
  return ((STM32_READ_BIT(RCC->APB3LPENR, periphs & LL_APB3_GRP1_PERIPH_ALL_LPEN_MASK) == \
           (periphs & LL_APB3_GRP1_PERIPH_ALL_LPEN_MASK)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB3 peripheral clocks in low-power mode.
  * @rmtoll
  *  APB3LPENR         SBSLPEN             LL_APB3_GRP1_DisableClockLowPower \n
  *  APB3LPENR         LPUART1LPEN         LL_APB3_GRP1_DisableClockLowPower \n
  *  APB3LPENR         LPTIM1LPEN          LL_APB3_GRP1_DisableClockLowPower \n
  *  APB3LPENR         RTCAPBLPEN          LL_APB3_GRP1_DisableClockLowPower
  * @param  periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB3_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB3_GRP1_PERIPH_SBS
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB3_GRP1_PERIPH_LPTIM1
  *         @arg @ref LL_APB3_GRP1_PERIPH_RTCAPB
  */
__STATIC_INLINE void LL_APB3_GRP1_DisableClockLowPower(uint32_t periphs)
{
  STM32_ATOMIC_CLEAR_BIT_32(RCC->APB3LPENR, periphs & LL_APB3_GRP1_PERIPH_ALL_LPEN_MASK);
}

/**
  * @}
  */ /* End of BUS_LL_EF_APB3 */

/**
  * @}
  */ /* End of BUS_LL_Exported_Functions */

/**
  * @}
  */ /* End of BUS_LL */

#endif /* RCC */

/**
  * @}
  */ /* End of STM32C5XX_LL_Driver */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_BUS_H */
